src/main/resources/sampleRequests/MakePayment.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:pay="http://kyc-payments.com/PaymentTypes"
                  xmlns:com="http://kyc-payments.com/CommonTypes">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" wsse:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>LHPH</wsse:Username>
                <wsse:Password>qwerty</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
        <dev:DeviceData xmlns:dev="http://kyc-payments.com/HeaderTypes">
            <dev:device>MOBILE</dev:device>
        </dev:DeviceData>
    </soapenv:Header>
    <soapenv:Body>
        <pay:MakePaymentRequest>
            <pay:payment>
                <com:reference>ABCDE1234567890</com:reference>
                <com:source>1</com:source>
                <com:amount>1</com:amount>
                <com:motive>ABONO</com:motive>
                <com:idBank>SB</com:idBank>
            </pay:payment>
        </pay:MakePaymentRequest>
    </soapenv:Body>
</soapenv:Envelope>